GHP-63-ECE/ARCS/ARCS-ESP32/src/main.cpp
bool homeGantryPosition() {
  int previousGantryPos = readEncoderGantry();
  setGantryPower(100); // Move gantry backward slowly
  delay(1000);
  int currentPosition = readEncoderGantry();
  while (true) {
    if (currentPosition == previousGantryPos){
      Serial.println("Gantry homed at position: " + String(currentPosition));
      stopGantry();
      noInterrupts();
      encoderValueGantry = 0;
      interrupts();
      hasZeroedGantry = true;
      return true;
    }
    previousGantryPos = currentPosition;
    delay(1000);
    currentPosition = readEncoderGantry();
  }
  return false;
  // while (currentPos)
}

// MARK: Extruder Functions

void extDirectionForward() {
  digitalWrite(EXT1, HIGH);
  digitalWrite(EXT2, LOW);
}

void extDirectionBackward() {
  digitalWrite(EXT1, LOW);
  digitalWrite(EXT2, HIGH);
}

void stopExtruder() {
  digitalWrite(EXT1, LOW);
  digitalWrite(EXT2, LOW);
  analogWrite(PWM_EXT, 0);
}

void setExtruderPower(int power) {
  if (power == 0) {
    stopExtruder();
  } else if (power < 0) {
    power = -power;
    extDirectionBackward();
  } else {
    extDirectionForward();
  }
  analogWrite(PWM_EXT, power);
}

bool setExtruderPosition(int targetPosMM, int maxSpeed){
  int targetPos = targetPosMM * gantryTicksPerMM;
  targetPos = constrain(targetPos, minGantryPosition, maxGantryPosition);
  long startLeft = readEncoderExtruder();

  pidControllerExt.Init(kP_ext, kI_ext, kD_ext);

  while (true) {
    long current = readEncoderExtruder();
    long error = targetPos - current;

    bool atTarget = abs(error) <= encoderToleranceTicks;

    Serial.print("Extruder Error: ");
    Serial.print(error);
    Serial.print(", Target: ");
    Serial.print(targetPos);   
    Serial.print(", Current: ");
    Serial.print(current);

    if (atTarget) {
      stopGantry();
      return true;
    }
    
    pidControllerExt.UpdateError(error);
    double output = pidControllerExt.TotalError();
    Serial.print(" Extruder PID Output: ");
    Serial.print(output);



    int speed = atTarget ? 0 : pidOutputToSpeed(output, error, maxSpeed);
    setExtruderPower(speed);
    Serial.print(" Extruder Speed: ");
    Serial.println(speed);
    delay(movementLoopDelayMs);
  }
}

// MARK: Encoder Updates

void updateEncoderLeft(){
  if (digitalRead(ENCAFL) > digitalRead(ENCBFL))
    encoderValueLeft++;
  else
    encoderValueLeft--;
}

void updateEncoderRight(){
  if (digitalRead(ENCAFR) > digitalRead(ENCBFR))
    encoderValueRight--;
  else
    encoderValueRight++;
}

void updateEncoderGantry(){
  if (digitalRead(ENCGANA) > digitalRead(ENCGANB))
    encoderValueGantry--;
  else
    encoderValueGantry++;
}

void updateEncoderExtruder(){
  if(digitalRead(ENCEXTA) > digitalRead(ENCEXTB)){
    encoderValueExtruder++;
  } else{
    encoderValueExtruder--;
  }
}

int readEncoderExtruder(){
  return encoderValueExtruder;
}

bool followPath(float ax[], float ay[]){
  bool proceed = false;
  for(int i = 4; i >= 0; i--){
    if(ax[i] == -1 && ay[i] == -1){
      Serial.println("No crack Detected");
      return false;
    }

    if(i != 4){
      cameraYOrigin = 0.5;
      float aax[5];
      float aay[5];
      aax[i] = ax[i] + (0.5-ax[i+1]);
      aay[i] = ay[i] + (0.5-ay[i+1]);
      Serial.println("AX: " + String(aax[i]));
      Serial.println("AY: " + String(aay[i]));
      driveToCrackCenterNoRot(aax[i], aay[i]);
    } else{
    driveToCrackCenterNoRot(ax[i], ay[i]);
    }
    // gantryAlign(ax[i]);
  }
  cameraYOrigin = -2;
  return true;
}

bool crackAuto() {
  float dCX = cx;
  float dCY = cy;
  driveToCrackCenter(dCX, dCY);
  gantryAlign(dCX);
  return true;
}

bool testAutoDrive() {
    int dCX = cx;
      int dCY = cy;
      while(true){
        driveToCrackCenter(dCX, dCY);
      }
      Serial.println("Aligned");
    return true;
}

void updateVision(){
  if (BS.available() > 0) {
    Serial.println("Connected");
    String rawData = BS.readStringUntil('\n');
    rawData.trim();
    Serial.println(rawData);
    if (rawData.length() > 0) {
      int cxIndex = rawData.indexOf("cx");
      int cyIndex = rawData.indexOf("cy");
      int xIndex = rawData.indexOf("x1");
      String xData = rawData.substring(cxIndex + 4, xIndex - cxIndex - 3);
      String yData = rawData.substring(cyIndex + 4, xIndex - cyIndex - 3);
      cx = xData.toFloat();
      cy = yData.toFloat();
      Serial.println("x" + xData);
      Serial.println("y" + yData);
      if(cx == -1 && cy == -1){
        cx = 0.5;
        cy = 0.5;
      }
    // Serial.println(rawData);
    }
  }
}

void updateVisionArray(){
  if (BS.available() > 0){
    String rawData = BS.readStringUntil('\n');
    rawData.trim();
    if(rawData.length() > 0){
      int x1Index = rawData.indexOf("x1");
      int x2Index = rawData.indexOf("x2");
      int x3Index = rawData.indexOf("x3");
      int x4Index = rawData.indexOf("x4");
      int cxIndex = rawData.indexOf("cx");

      int y1Index = rawData.indexOf("y1");
      int y2Index = rawData.indexOf("y2");
      int y3Index = rawData.indexOf("y3");
      int y4Index = rawData.indexOf("y4");
      int cyIndex = rawData.indexOf("cy");
      
      String x1Data = rawData.substring(x1Index + 4, x2Index - x1Index - 3);
      String x2Data = rawData.substring(x2Index + 4, x3Index - x2Index - 3);
      String x3Data = rawData.substring(x3Index + 4, x4Index - x3Index - 3);
      String x4Data = rawData.substring(x4Index + 4, cxIndex - x4Index - 3);
      String cxData = rawData.substring(cxIndex + 4, cyIndex - cxIndex - 3);

      String y1Data = rawData.substring(cyIndex + 4, cxIndex - cyIndex - 3);
      String y2Data = rawData.substring(y1Index + 4, y2Index - y1Index - 3);
      String y3Data = rawData.substring(y2Index + 4, y3Index - y2Index - 3);
      String y4Data = rawData.substring(y3Index + 4, y4Index - y3Index - 3);
      String cyData = rawData.substring(y4Index + 4, y3Index - y4Index - 3);
      
      ax[0] = cxData.toFloat();
      ax[1] = x1Data.toFloat();
      ax[2] = x2Data.toFloat();
      ax[3] = x3Data.toFloat();
      ax[4] = x4Data.toFloat();

      ay[0] = y1Data.toFloat();
      ay[1] = y2Data.toFloat();
      ay[2] = y3Data.toFloat();
      ay[3]= y4Data.toFloat();
      ay[4] = y4Data.toFloat();
    }
  }
}

// MARK: Setup
void setup() {

